[CLS]
[MASK]
[PAD]
[SEP]
[UNK]
a
ab
about
act
activ
activity
actor
actors
actres
actresses
al
alg
alge
algeb
algebra
algor
algorith
algorithm
algorithms
all
allow
allows
alter
alternat
alternatives
am
among
an
anal
analy
analys
analysis
analytical
and
ant
anthro
anthrop
anthropology
ap
appl
applic
application
appro
approa
approach
approaches
ar
arch
archa
archae
archaeology
archit
architect
architecture
are
art
artific
artificial
artist
artistic
arts
ary
as
ast
at
ate
ated
ates
ation
ational
ations
atmo
atmos
atmosph
atmosphe
atmosphere
atom
atoms
att
attent
attention
aut
autom
automates
av
ava
avail
availab
available
b
bas
based
basis
be
beaut
beauty
been
behav
behavior
ber
bert
best
bet
betw
betwe
between
bi
bidi
bidire
bidirectional
bio
bioin
bioinform
bioinformat
bioinformatics
biolog
biological
biology
body
bran
branch
bro
broa
broader
bu
buil
building
by
c
cal
calcul
calculus
ce
cell
cells
cer
ceram
ceramics
ces
cess
ch
chan
change
chem
chemical
chemist
chemistry
ci
cin
cinem
cinema
cipl
clin
clinical
col
coll
collab
collabor
collaborat
collaborative
com
comm
commun
communic
communicate
compl
complex
complexity
comput
computational
computer
computers
con
conce
concept
concepts
concer
concern
concerned
concerning
concerns
cons
consci
conscious
consi
conside
considere
considered
consum
consumption
cont
contex
context
contin
continu
continuous
contr
contrast
cr
cra
craf
craft
crafts
cre
creat
creating
criter
criterion
ct
ction
ctional
cul
cult
cultural
culture
d
dat
data
de
deal
deals
dee
deep
def
defending
dem
demon
demonstr
demonstrated
der
des
descr
describ
described
describes
desig
design
deter
determin
determining
dev
devel
develop
development
develops
devo
devot
devoted
di
dif
diff
differ
different
ding
dis
displ
displa
display
displayed
dist
distr
distrib
distribution
doc
docum
documents
dom
domest
domestic
dr
dra
draw
drawing
driv
driven
dy
dyn
dynam
dynamic
dynamics
e
ear
earth
eat
econ
economics
ect
ed
edit
editing
el
ele
eleg
elegant
elem
element
elements
ell
em
emat
en
enc
ence
encod
encoder
encom
encomp
encompas
encompasses
ending
ener
energ
energy
eng
engine
engineer
engineering
ent
ents
env
envir
environ
environmental
equ
equations
er
ers
es
espe
especi
especiall
especially
est
et
eth
ethics
ev
event
evol
evolution
ex
exist
existence
exper
experi
experien
experience
experiences
expres
express
expression
extra
extract
f
fam
famil
family
fe
feat
featu
features
feel
feeling
feelings
fi
fiel
field
fields
fil
film
filmmaking
foc
focus
focuses
focusing
for
form
formers
forms
fr
fra
frame
framework
from
fun
function
functional
fund
fundam
fundament
fundamental
g
ge
gen
gener
general
generates
genom
genomes
genomics
geog
geogra
geography
geom
geomet
geometry
go
good
goods
gra
h
hand
handling
har
harm
harmon
harmony
has
hav
have
heat
high
hist
history
hum
human
humans
i
ial
ib
ic
ical
ics
ide
ideas
ies
if
ific
ig
igh
il
ima
imag
imagin
imagined
imaging
in
inc
incl
inclu
including
ind
indiv
indivi
individ
individual
individuals
ine
ing
inh
inhab
inhabit
inhabitant
inhabitants
input
inst
instit
institution
institutions
int
intell
intellect
intellectual
intellig
intelligence
inter
intera
interaction
interactions
interdis
interdiscipl
interdisciplin
interdisciplinary
interior
international
interp
interpre
interpret
interpretation
invol
involv
involves
involving
ion
ior
ir
is
ist
istics
it
iter
iterat
iterativ
iterativel
iteratively
ith
ity
iv
ive
ives
iz
ization
k
king
kn
know
knowl
knowled
knowledge
l
lan
land
lands
lang
langu
langua
language
le
lear
learn
learning
level
lin
linear
ling
lingu
linguistics
literat
literature
live
m
ma
mach
machin
machine
machines
making
map
mapp
mapping
maps
mat
mater
material
math
mathemat
mathematical
mathematics
me
mean
meaning
mechan
mechanics
mechanis
mechanism
med
medi
medical
medium
mel
melody
ment
mental
meth
method
methods
min
mind
mo
mod
model
modeling
mol
mole
molecul
molecular
mor
moral
mus
music
n
nat
national
natural
nature
ne
net
network
networks
neural
o
oc
od
ody
of
og
ol
olog
ology
om
omics
on
ong
op
oper
operations
opti
optim
optimization
or
org
organ
organiz
organized
ory
ose
ous
out
output
ow
p
pa
paint
painting
part
parts
past
pe
per
perce
perception
perceptions
perform
performers
performing
persp
perspect
perspectives
ph
phen
phenom
phenomen
phenomena
phil
philo
philoso
philosophy
pho
photo
photogra
photography
phy
phys
physical
physics
pl
plan
planet
planets
pol
polit
political
politics
pow
power
pr
pres
present
prin
principl
principles
print
printmaking
pro
prob
proba
probabi
probabil
probability
process
processes
processing
prod
produ
produc
producing
production
progra
program
programm
programming
proper
properti
properties
psy
psych
psychology
pt
ption
pur
purp
purpose
put
pyth
python
q
qu
quant
quantum
quest
question
questions
r
ra
radi
radiation
ran
rand
random
re
real
reas
reason
rec
reco
recomm
recommending
recovery
reg
regar
regard
rel
related
relation
relations
relationsh
relationshi
relationship
relationships
represent
representation
representations
represents
requ
requi
require
requirement
requirements
res
rh
rhyth
rhythm
righ
right
ro
ry
s
scal
scale
schem
scheme
sci
science
scient
scientific
scul
sculpt
sculpture
se
sele
selection
sem
semant
semantics
sequ
sequence
ser
serv
servic
services
ses
set
sh
shap
shape
si
sim
simul
simulate
simulation
so
soci
social
societ
societies
society
sociology
sof
soft
softw
software
som
some
soun
sound
sp
spa
space
spaces
st
stand
stands
stat
statist
statistical
statistics
stor
stories
str
stru
struct
structure
stu
studi
studies
study
su
sub
subfield
subword
suc
success
successf
successful
such
sy
syn
synt
synta
syntax
syst
system
systemat
systematic
systematiz
systematizing
systems
t
tas
task
tasks
te
tech
techn
techni
techniqu
technique
tem
temper
temperat
temperature
ter
term
terms
th
that
the
theat
theater
their
theo
theore
theoretical
theory
ther
thermo
thermodynamics
thes
these
thin
thinking
those
thro
throu
throug
through
ti
tical
time
to
tok
token
tokenization
tool
tools
tra
train
training
tran
trans
transformers
ty
type
u
ual
ul
um
un
unconscious
under
understand
understanding
unit
units
ur
ural
ure
us
used
uses
using
usual
usuall
usually
ut
ution
v
val
valu
value
values
vect
vector
vel
ver
very
vide
video
vis
visual
voc
vocab
vocabul
vocabulary
vol
w
well
wh
when
whic
which
whose
with
wor
word
wordp
wordpi
wordpie
wordpiece
words
work
works
wr
writ
writt
written
wrong
x
y
ys
yth
z
