[CLS]
[MASK]
[PAD]
[SEP]
[UNK]
a
act
action
actions
activ
activit
activity
ag
age
agent
agents
al
alg
algor
algorith
algorithm
all
allow
allows
am
an
anal
analy
analys
analysis
analytic
analytical
and
ar
arch
archit
archite
architect
architectu
architecture
are
area
art
artific
artifici
artificial
as
at
ated
ates
ation
att
attent
attention
aut
autom
automates
b
bas
based
be
been
ber
bert
bi
bid
bidire
bidirection
bidirectional
bio
biol
biolog
biologic
biological
bro
broa
broader
bu
buil
build
building
by
c
ce
ces
cess
ch
ci
com
comput
computation
computational
computer
computers
computing
con
conc
concer
concerne
concerned
ct
ction
d
dat
data
de
deal
deals
ded
dedic
dedicated
dee
deep
dem
demon
demonst
demonstr
demonstrated
der
dif
diff
differ
different
dis
disci
discip
discipl
disciplin
disciplinar
disciplinary
dr
driv
driven
e
ed
el
em
en
enc
ence
encod
encoder
ent
er
es
ex
extr
extract
f
fam
famil
family
fi
fiel
field
fo
foc
focus
for
form
fr
from
fun
function
g
ga
gain
gen
gener
general
generates
h
has
hig
high
how
i
ic
ie
if
ific
ig
il
im
image
images
in
inform
information
ing
input
ins
insp
inspire
inspired
int
intel
intell
intellig
intelligence
inter
interdisciplinary
ion
ire
is
it
ith
iv
k
kn
know
knowle
knowled
knowledg
knowledge
l
lan
lang
langu
language
le
lear
learn
learning
learns
lev
level
ling
lingu
linguis
linguistic
linguistics
m
ma
mach
machin
machine
machines
map
maps
me
mech
mechan
mechanis
mechanism
meth
method
methods
mod
model
n
nat
natural
ne
need
net
networ
network
networks
neural
o
ob
obta
obtain
obtaining
od
of
og
om
on
or
out
output
ow
p
part
parts
patt
patter
pattern
patterns
pe
pro
process
processing
prog
progr
program
programm
programming
pur
purp
purpo
purpose
put
py
pyth
python
q
r
re
reas
reason
reasoning
rec
recog
recogn
recognit
recognition
rein
reinfor
reinforce
reinforcem
reinforcement
rel
rele
relev
relevan
relevant
rep
repres
represent
representation
representations
representing
res
reso
resour
resources
retr
retrie
retriev
retrieval
ro
s
sch
sche
scheme
sci
science
scient
scientific
se
seq
sequ
sequence
spe
spee
speech
st
stand
stands
stu
stud
study
su
sub
subfield
subto
subtop
subtopic
subword
suc
success
successf
successfu
successful
sup
super
supervis
supervised
sy
syst
system
systems
t
ta
tak
take
tas
task
th
that
the
thin
think
thinking
tic
to
tok
token
tokeni
tokeniz
tokenization
tr
tran
trans
transform
transformer
transformers
ty
type
u
un
under
understand
understanding
unit
units
unsupervised
unt
untag
untagg
untagged
ur
ural
us
uses
ut
v
vag
vagu
vaguel
vaguely
ver
very
vis
vision
w
wh
whic
which
with
wor
word
wordp
wordpie
wordpiece
x
y
z
